## OpenTofu Plan

**Environment:** `pl-identity-dev`
**Directory:** `./2_platform_identity/environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.management: Reading...
data.terraform_remote_state.management: Read complete after 2s

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.monitoring_alerts.azurerm_monitor_action_group.identity_alerts will be created
  + resource "azurerm_monitor_action_group" "identity_alerts" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "ag-identity-alerts-dev-gwc-01"
      + resource_group_name = "rg-identity-monitoring-dev-gwc-01"
      + short_name          = "id-alert"
      + tags                = {
          + "cost_center" = "platform"
          + "environment" = "dev"
          + "managed_by"  = "opentofu"
          + "owner"       = "platform-team"
          + "project"     = "levendaal"
        }

      + email_receiver {
          + email_address           = "krijnvdburg@protonmail.com"
          + name                    = "security-team"
          + use_common_alert_schema = true
        }
    }

  # module.monitoring_alerts.azurerm_monitor_activity_log_alert.admin_activity will be created
  + resource "azurerm_monitor_activity_log_alert" "admin_activity" {
      + description         = "Alert on administrative role assignment changes in identity subscription"
      + enabled             = true
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "alert-admin-activity-dev-gwc-01"
      + resource_group_name = "rg-identity-monitoring-dev-gwc-01"
      + scopes              = [
          + "/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c",
        ]
      + tags                = {
          + "cost_center" = "platform"
          + "environment" = "dev"
          + "managed_by"  = "opentofu"
          + "owner"       = "platform-team"
          + "project"     = "levendaal"
        }

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Informational"
          + operation_name = "Microsoft.Authorization/roleAssignments/write"

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.monitoring_alerts.azurerm_resource_group.monitoring will be created
  + resource "azurerm_resource_group" "monitoring" {
      + id       = (known after apply)
      + location = "germanywestcentral"
      + name     = "rg-identity-monitoring-dev-gwc-01"
      + tags     = {
          + "cost_center" = "platform"
          + "environment" = "dev"
          + "managed_by"  = "opentofu"
          + "owner"       = "platform-team"
          + "project"     = "levendaal"
        }
    }

  # module.sg_rbac_platform_contributors.azuread_group.this will be created
  + resource "azuread_group" "this" {
      + assignable_to_role             = false
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Members have Contributor access to platform subscriptions via Azure RBAC"
      + display_name                   = "sg-rbac-platform-contributors-dev-na-01"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + action_group_identity_alerts  = {
      + id = (known after apply)
    }
  + alert_rule_admin_activity     = {
      + id = (known after apply)
    }
  + monitoring_resource_group     = "rg-identity-monitoring-dev-gwc-01"
  + sg_rbac_platform_contributors = {
      + display_name = "sg-rbac-platform-contributors-dev-na-01"
      + id           = (known after apply)
      + object_id    = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/pl-identity-dev-tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/pl-identity-dev-tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit 88a853abcd983944ae6ad28e8278ad87bbdcf390*